# Aufgaben 4, 7, 8

Bibs

In [188]:
import pandas as pd
import os
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

Daten laden

In [189]:
url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv'
file = 'data/titanic_2_original.pickle' # Damit es local gespeichert wird

if os.path.exists(file):
    t = pd.read_pickle(file)
else:
    t = pd.read_csv(url)
    t.to_pickle(file)
t.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
442,443,0,3,"Petterson, Mr. Johan Emil",male,25.0,1,0,347076,7.7750,NaN,S
663,664,0,3,"Coleff, Mr. Peju",male,36.0,0,0,349210,7.4958,NaN,S
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.5500,NaN,S
749,750,0,3,"Connaghton, Mr. Michael",male,31.0,0,0,335097,7.7500,NaN,Q
452,453,0,1,"Foreman, Mr. Benjamin Laventall",male,30.0,0,0,113051,27.7500,C111,C
602,603,0,1,"Harrington, Mr. Charles H",male,NaN,0,0,113796,42.4000,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
657,658,0,3,"Bourke, Mrs. John (Catherine)",female,32.0,1,1,364849,15.5000,NaN,Q
598,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.2250,NaN,C
226,227,1,2,"Mellors, Mr. William John",male,19.0,0,0,SW/PP 751,10.5000,NaN,S

### Aufgabe 4 BINS
4.1. LÃ¶sen Sie das Beispiel aus der Vorlesung ohne die Methode pd.cut() zu
verwenden.

In [190]:
import pandas as pd

def age_to_class(age):
    """
    Konvertiert ein Alter in eine Altersklasse.

    Parameter:
    age (int oder float): Das Alter, das konvertiert werden soll.

    RÃ¼ckgabe:
    str: Die entsprechende Altersklasse.
    """
    if age <= 12: return 'child'
    if age <= 18: return 'teenager'
    if age <= 18: return 'worker'
    if age <= 18: return 'elder'
    return pd.NA

# Angenommen, wir haben einen DataFrame 'df' mit einer Spalte 'Age'
df = pd.DataFrame({'Age': [5, 15, 30, 70, 120, -5]})

# Anwenden der Funktion mit map()
df['Age class map'] = df['Age'].map(age_to_class)

# Anwenden der Funktion mit apply()
df['Age class apply'] = df['Age'].apply(age_to_class)

print(df)

   Age Age class map Age class apply
0    5         child           child
1   15      teenager        teenager
2   30          <NA>            <NA>
3   70          <NA>            <NA>
4  120          <NA>            <NA>
5   -5         child           child

4.2. Wir modifizieren die Anforderung leicht, so dass nun zwei Spalten als Input fÃ¼r <br>
die Funktion verwendet werden. Anstelle âadultâ wollen wir âmaleâ / âfemaleâ <br>
entsprechend des âSexâ stehen haben.

In [191]:
import pandas as pd

def age_and_sex_to_class(row):
    """
    Konvertiert Alter und Geschlecht in eine Altersklasse.

    Parameter:
    row (Series): Eine Zeile des DataFrame, die 'Age' und 'Sex' enthÃ¤lt.

    RÃ¼ckgabe:
    str: Die entsprechende Altersklasse.
    """
    age, sex = row['Age'], row['Sex']
    if age >= 0 and age <= 12: return 'child'
    if age > 12 and age <= 18: return 'teenager'
    if age > 18 and age <= 65 and sex == 'male': return 'adult,'+ 'male'
    if age > 18 and age <= 65 and sex == 'female': return 'adult,'+ 'female'
    if age > 65 and age <= 100: return 'elder'
    else:
        return pd.NA

# Beispiel-DataFrame
df = pd.DataFrame({
    'Age': [5, 16, 30, 42, 68, 120, -5],
    'Sex': ['male', 'female', 'male','female', 'female', 'male', 'female']
})

# Anwenden der Funktion mit apply()
df['Age class'] = df.apply(age_and_sex_to_class, axis=1)

print(df)

   Age     Sex     Age class
0    5    male         child
1   16  female      teenager
2   30    male    adult,male
3   42  female  adult,female
4   68  female         elder
5  120    male          <NA>
6   -5  female          <NA>

### 4.3. Bins anhand von Quartilen (qcut())

a) Teilen Sie die âFareâ in die vier Quartile ein. Benennen Sie die Quartile sinnvoll (âbilligâ,
ânormalâ,..). <br> Das Ergebnis sollte eine Spalte im titanic-Datensatz sein, welches das
entsprechende Quartil enthÃ¤lt.

In [192]:
# Namen fÃ¼r Bins
bins = ['billig', 'normal', 'teuer', 'sehr teuer']
t["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)

t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,billig
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,normal
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,normal

b) Wie sind die Quartile definiert (was sind die oberen und unteren Grenzen der âFareâ
jedes Quartils?

Das erste Quartil (billig) umfasst Werte von der niedrigsten 'Fare' bis zum 25. Perzentil. <br>
Das zweite Quartil (normal) reicht vom 25. Perzentil bis zum Median (50. Perzentil). <br>
Das dritte Quartil (teuer) erstreckt sich vom Median bis zum 75. Perzentil. <br>
Das vierte Quartil (sehr teuer) umfasst Werte vom 75. Perzentil bis zur hÃ¶chsten 'Fare'.

c) Was ist der Median von âFareâ?

In [193]:
t['Fare'].median()

14.4542

d) Wiederholen Sie die Aufgabe, aber nun getrennt nach âPclassâ.

In [194]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,billig
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,normal
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,normal

In [195]:
t_group = t.groupby(by=['Pclass'])

In [196]:
t_group.groups.keys()

dict_keys([1, 2, 3])

In [197]:
first_class =t_group.get_group(1)
seccond_class = t_group.get_group(2)
third_class = t_group.get_group(3)

a) wdh

In [198]:
# Namen fÃ¼r Bins
bins = ['billig', 'normal', 'teuer', 'sehr teuer']
first_class["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)
seccond_class["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)
third_class["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)


first_class.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,sehr teuer
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,teuer
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,sehr teuer

c) wdh

In [199]:
first_class["Fare"].median()

60.287499999999994

In [200]:
seccond_class["Fare"].median()

14.25

In [201]:
third_class["Fare"].median()

8.05

### 4.4. Alleine oder mit Familie?

a) Berechnen Sie eine Spalte âAloneâ, die anzeigt, ob ein Passagier allein gereist ist oder
mit Familie. <br> Familie wÃ¼rde bedeuten, dass entweder Bruder / Schwester / Ehefrau /
Ehemann oder Eltern / Kinder mit an Bord waren.

In [202]:
# Berechne die 'Alone'-Spalte
# Ein Passagier ist allein, wenn sowohl 'SibSp' als auch 'Parch' gleich 0 sind
t['Alone'] = ((t['SibSp'] == 0) & (t['Parch'] == 0)).astype(int)

In [203]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,billig,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,normal,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,normal,1

b) Wie kÃ¶nnte man die Korrektheit dieser Information in den Daten Ã¼berprÃ¼fen?

Man kÃ¶nnte den Nachnamen von Personen mit Familienmitgliedern auf Duplikate prÃ¼fen. Bsp. Ehemann/Frau haben i.d.R. gleichen Nachnamen

### Aufgabe 7 NULL
7.1. Detect <br>
a) Geben sie alle Passagiere aus, fÃ¼r die die Altersangabe fehlt.

In [204]:
no_age = t[t["Age"].isna()]
print(no_age)

     PassengerId  Survived  Pclass                                      Name  \
5              6         0       3                          Moran, Mr. James
17            18         1       2              Williams, Mr. Charles Eugene
19            20         1       3                   Masselmani, Mrs. Fatima
26            27         0       3                   Emir, Mr. Farred Chehab
28            29         1       3             O'Dwyer, Miss. Ellen "Nellie"
..           ...       ...     ...                                       ...
859          860         0       3                          Razi, Mr. Raihed
863          864         0       3         Sage, Miss. Dorothy Edith "Dolly"
868          869         0       3               van Melkebeke, Mr. Philemon
878          879         0       3                        Laleff, Mr. Kristo
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"

        Sex  Age  SibSp  Parch      Ticket     Fare Cabin Embarked  \
5      male  NaN      0      0      330877   8.4583   NaN        Q
17     male  NaN      0      0      244373  13.0000   NaN        S
19   female  NaN      0      0        2649   7.2250   NaN        C
26     male  NaN      0      0        2631   7.2250   NaN        C
28   female  NaN      0      0      330959   7.8792   NaN        Q
..      ...  ...    ...    ...         ...      ...   ...      ...
859    male  NaN      0      0        2629   7.2292   NaN        C
863  female  NaN      8      2    CA. 2343  69.5500   NaN        S
868    male  NaN      0      0      345777   9.5000   NaN        S
878    male  NaN      0      0      349217   7.8958   NaN        S
888  female  NaN      1      2  W./C. 6607  23.4500   NaN        S

      Fare_Bins  Alone
5        normal      1
17       normal      1
19       billig      1
26       billig      1
28       billig      1
..          ...    ...
859      billig      1
863  sehr teuer      0
868      normal      1
878      billig      1
888       teuer      0

[177 rows x 14 columns]

b)Wie viele

In [205]:
t["Name"].isna().count()

891

c) Wie viele Werte sind jeweils fÃ¼r jede andere Spalte Null?

In [206]:
t.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Fare_Bins        0
Alone            0
dtype: int64

d) Wie viele Zeilen haben in irgendeiner Spalte eine Null?

In [207]:
t.isna().any(axis=1).sum()

708

7.2. Deal with <br>
a) Ersetzen Sie die fehlenden Alterswerte durch den Median aller Passagiere.

In [208]:
# Berechne den Median des Alters
age_median = t['Age'].median()

In [209]:
# Ersetze fehlende Alterswerte durch den Median
t['Age'].fillna(age_median, inplace=True)

In [210]:

# ÃberprÃ¼fe, ob es noch fehlende Werte in der 'Age'-Spalte gibt
print(t['Age'].isna().sum())
print(age_median)

177
28.0

b) Ersetzen Sie die fehlenden Alterswerte durch den Mittelwert in der jeweiligen P-Klasse.

In [211]:
# Berechne den Mittelwert des Alters fÃ¼r jede Passagierklasse
mean_age_by_pclass = t.groupby('Pclass')['Age'].transform('mean')

# Ersetze fehlende Alterswerte durch den Mittelwert in der jeweiligen Pclass
t['Age'].fillna(mean_age_by_pclass, inplace=True)

# ÃberprÃ¼fe, ob es noch fehlende Werte in der 'Age'-Spalte gibt
print(t['Age'].isnull().sum())

177

c) LÃ¶schen Sie alle Passagiere mit unbekanntem âEmbarkedâ. <br>
d) Wie viele Zeilen wurden gelÃ¶scht?

In [212]:
# Anzahl der Zeilen vor dem LÃ¶schen
embarked_len = len(t)

# LÃ¶sche alle Zeilen, in denen 'Embarked' NaN ist
t.dropna(subset=['Embarked'], inplace=True)

# Anzahl der Zeilen nach dem LÃ¶schen
no_embarked_len = len(t)

rows_lost = embarked_len-no_embarked_len

print(f"Anzahl der gelÃ¶schten Zeilen: {rows_lost}")

Anzahl der gelÃ¶schten Zeilen: 2

### Aufgabe 8 <br>
a) Extrahieren Sie die Nachnamen

In [213]:
# Extrahiere Nachnamen
t['LastName'] = t['Name'].apply(lambda name: name.split(',')[0])

# Anzeigen der ersten paar Zeilen zur ÃberprÃ¼fung
print(t[['Name', 'LastName']].head())

                                                Name   LastName
0                            Braund, Mr. Owen Harris     Braund
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
2                             Heikkinen, Miss. Laina  Heikkinen
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
4                           Allen, Mr. William Henry      Allen

c) Berechnen Sie fÃ¼r die Nachnamen die Soundex-Werte

In [215]:
import soundex

In [216]:
# Extrahiere Nachnamen
t['LastName'] = t['Name'].apply(lambda name: name.split(',')[0])

# Initialisiere Soundex-Instanz
soundex_instance = soundex.Soundex()

# Berechne Soundex-Werte
t['Soundex'] = t['LastName'].apply(lambda x: soundex_instance.soundex(x))

# Anzeigen der ersten paar Zeilen zur ÃberprÃ¼fung
print(t[['LastName', 'Soundex']].head())

    LastName Soundex
0     Braund    B653
1    Cumings     C52
2  Heikkinen     H25
3   Futrelle    F364
4      Allen     A45

 Untersuchen Sie Passagiere mit identischem Soundex, um Duplikate zu finden (das kann
man mit einem Join machen). Die Ergebnismenge muss weiter eingeschrÃ¤nkt werden,
z.B. indem man das Geschlecht oder die Ticket Nummer berÃ¼cksichtigt.
Finden Sie ein echtes Duplikat?

In [217]:
# Initialisiere Soundex-Instanz und extrahiere Nachnamen
soundex_instance = soundex.Soundex()
t['LastName'] = t['Name'].apply(lambda name: name.split(',')[0])
t['Soundex'] = t['LastName'].apply(lambda x: soundex_instance.soundex(x))

# FÃ¼hre einen Self-Join auf dem DataFrame basierend auf dem Soundex-Code durch
# und schlieÃe zusÃ¤tzliche Kriterien wie Geschlecht und Ticketnummer ein
duplikate = pd.merge(t, t, on=['Soundex'], suffixes=('_left', '_right'))
duplikate = duplikate[(duplikate['Sex_left'] == duplikate['Sex_right']) & 
                      (duplikate['Ticket_left'] == duplikate['Ticket_right']) &
                      (duplikate['LastName_left'] != duplikate['LastName_right'])]

# ÃberprÃ¼fe die Ergebnisse
print(duplikate[['Name_left', 'Name_right', 'Soundex', 'Sex_left', 'Ticket_left']])

           Name_left      Name_right Soundex Sex_left Ticket_left
1604   Ling, Mr. Lee  Lang, Mr. Fang     L52     male        1601
1607  Lang, Mr. Fang   Ling, Mr. Lee     L52     male        1601